BAS BMEKZU Project/src/Catalogs/СхемыРеализации/СхемыРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СхемыРеализации</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>СписаниеБезнадежнойЗадолженности</name>
      <description>(не исп. с 2015) Списание безнадежной задолженности</description>
    </items>
    <items>
      <name>НО</name>
      <description>Необоротные активы</description>
    </items>
    <items>
      <name>Полуфабрикаты</name>
      <description>Полуфабрикаты (собственного производства)</description>
    </items>
    <items>
      <name>Продукция</name>
      <description>Продукция</description>
    </items>
    <items>
      <name>ПроизводственныеЗапасы</name>
      <description>Производственные запасы (покупные)</description>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
    </items>
    <items>
      <name>Услуги</name>
      <description>Услуги</description>
    </items>
  </predefined>
  <attributes>
    <name>СчетДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДоходов1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДоходов2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДоходов3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетСебестоимости</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСебестоимости1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСебестоимости2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСебестоимости3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетВычетовИзДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоВычетовИзДоходов1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоВычетовИзДоходов2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоВычетовИзДоходов3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетСебестоимостиПриВозврате</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСебестоимостиПриВозврате1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСебестоимостиПриВозврате2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСебестоимостиПриВозврате3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/Catalogs/СхемыРеализации/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СчетСебестоимостиПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.СчетСебестоимости, "Себестоимости");
	ПриИзмененииСчета(Объект, Объект.СчетСебестоимости, "Себестоимости");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетСебестоимостиПриВозвратеПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.СчетСебестоимостиПриВозврате, "СебестоимостиПриВозврате");
	ПриИзмененииСчета(Объект, Объект.СчетСебестоимостиПриВозврате, "СебестоимостиПриВозврате");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.СчетДоходов, "Доходов");
	ПриИзмененииСчета(Объект, Объект.СчетДоходов, "Доходов");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетВычетовИзДоходовПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.СчетВычетовИзДоходов, "ВычетовИзДоходов");
	ПриИзмененииСчета(Объект, Объект.СчетВычетовИзДоходов, "ВычетовИзДоходов");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Счет, Постфикс = "")

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
								"Субконто" + Постфикс + "1",
								"Субконто" + Постфикс + "2",
								"Субконто" + Постфикс + "3");
								
	ЗаголовкиПолей = Новый Структура("Субконто1, Субконто2, Субконто3",
								"ЗаголовокСубконто" + Постфикс + "1",
								"ЗаголовокСубконто" + Постфикс + "2",
								"ЗаголовокСубконто" + Постфикс + "3");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Счет, Форма, ПоляФормы, ЗаголовкиПолей, Ложь);
	
	УстановитьТекстСубконтоНоменклатурнаяГруппа(Счет, Форма, ПоляФормы, Постфикс);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииСчета(Объект, Счет, Постфикс = "")

	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3",
								"Субконто" + Постфикс + "1",
								"Субконто" + Постфикс + "2",
								"Субконто" + Постфикс + "3");

	БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Счет, Объект, ПоляОбъекта);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекстСубконтоНоменклатурнаяГруппа(Счет, Форма, ПоляФормы, Постфикс)
	
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	
	Для Индекс = 1 По 3 Цикл
		Если ПоляФормы.Свойство("Субконто" + Индекс) Тогда
			Если ДанныеСчета["ВидСубконто" + Индекс] = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы") Тогда
				Форма.Элементы["Субконто" + Постфикс + Индекс].ТолькоПросмотр = Истина;
				Форма.Элементы["Субконто" + Постфикс + Индекс].ПодсказкаВвода = "из свойств номенклатуры";
			Иначе
				Форма.Элементы["Субконто" + Постфикс + Индекс].ТолькоПросмотр = Ложь;
				Форма.Элементы["Субконто" + Постфикс + Индекс].ПодсказкаВвода = "";
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	
    УстановитьЗаголовкиИДоступностьСубконто(Форма, Объект.СчетСебестоимости, "Себестоимости");
	УстановитьЗаголовкиИДоступностьСубконто(Форма, Объект.СчетСебестоимостиПриВозврате, "СебестоимостиПриВозврате");
	УстановитьЗаголовкиИДоступностьСубконто(Форма, Объект.СчетДоходов, "Доходов");
	УстановитьЗаголовкиИДоступностьСубконто(Форма, Объект.СчетВычетовИзДоходов, "ВычетовИзДоходов");

КонецПроцедуры // УстановитьВидимостьСубконто()
